[
  { "text": "Very competent provider and top-notch work" },
  { "text": "Steve is one of the best providers that I've had the pleasure of working with on Upwork. I will definitely use him again and I would recommend him to anyone. The price was fair and the project was completed in a very timely manner. Steve delivered exactly what I needed." },
  { "text": "Fast turnaround, understood exactly what I needed and was very professional and provided clean code. I will be using him again! Thank you!" },
  { "text": "Very pleased... will definitely use Steven again." },
  { "text": "Very pleased and impressed. We'll use Steven again and won't hesitate to recommend." },
  { "text": "BEST DEVELOPER ON THE PLANET. If you are lucky enough to have Steven bid on your project, you should not even consider hiring anyone else." },
  { "text": "I cant say enough good things about Steve. He was extremely professional and courteous and more importantly, COMPETENT. I have extremely high standards for people that I work with and Steven exceeded our expectations. Will definitely work with him again in the future." },
  { "text": "This is the fifth Upwork project that I have been involved with in one form or another and it has been BY FAR the best experience that I have had. I really can't say enough good things about working with Steven. Steven took the time to understand both what I wanted from a technical point of view and what I was trying to achieve from a business point of view - and then ensured that the solution he delivered met all my needs. On top of that the speed of responses and delivery was impressive. Steven has an extremely high attention to detail, extremely strong technical skills, extraordinary integrity and cares about the projects he takes on. I have already sole-sourced my next project to him. VERY HIGHLY RECOMMENDED!" },
  { "text": "Great working with Steven. I previously provided him with a glowing review and wouldn't change a single word of it. I have recommended him to a friend without hesitation. " },
  { "text": "Steven proved to be an extremely reliable, efficient and technically excellent software developer. He remained highly communicative throughout the project and responded with great professionalism and a much appreciated \"can do\" attitude in a project that grew to become considerably more complex as it evolved. The web app Steven helped us to build forms the centrepiece of our upcoming product launch and we couldn't be happier with his work. I have no hesitation in recommending Steven to anyone seeking a highly skilled web developer." },
  { "text": "Great person and great quality. Above and beyond what we expected." },
  { "text": "Could not ask for a better person to work with." },
  { "text": "Extremely knowledgeable and a pleasure to work with. If anything, we slowed him down! He would have had it done in 2 days if we had everything ready for him. Just a great experience." },
  { "text": "Steve is one of the best HTML & CSS professionals we've worked with. Give him work, but not too much because we love working with him." },
  { "text": "Steve helped me with a small project with a very quick turnaround. The quality of his work was excellent and he delivered ahead of schedule." }
]